sonydevworld/spresense-arduino-compatible/Arduino15/packages/SPRESENSE/hardware/spresense/1.0.0/boards.txt
menu.Debug=Debug
menu.UploadSpeed=UploadSpeed

############## Spresense BOARD ##############
spresense.name=Spresense

spresense.vid.0=0x10C4
spresense.pid.0=0xEA60

spresense.upload.tool=spresense-tools
spresense.upload.speed=115200
spresense.upload.resetmethod=ck
spresense.upload.maximum_size=786432
spresense.upload.maximum_data_size=786432
spresense.upload.wait_for_upload_port=true
spresense.serial.disableDTR=false
spresense.serial.disableRTS=true

spresense.bootloader.tool=spresense-tools

spresense.build.mcu=spresense
spresense.build.f_cpu=156000000L
spresense.build.board=spresense_ast
spresense.build.core=spresense
spresense.build.variant=spresense
spresense.build.debug=
spresense.build.libpath=
spresense.build.stack=-Wl,--defsym,__stack=_vectors+{upload.maximum_size}

spresense.menu.Debug.Disabled=Disabled
spresense.menu.Debug.Disabled.build.debug=
spresense.menu.Debug.Disabled.build.type=release
spresense.menu.Debug.Disabled.build.root={runtime.tools.spresense-sdk.path}/spresense
spresense.menu.Debug.Disabled.build.kernel={build.root}/{build.type}
spresense.menu.Debug.Disabled.build.libpath={build.kernel}/prebuilt

spresense.menu.Debug.Enabled=Enabled
spresense.menu.Debug.Enabled.build.debug=-DBRD_DEBUG
spresense.menu.Debug.Enabled.build.type=debug
spresense.menu.Debug.Enabled.build.root={runtime.tools.spresense-sdk.path}/spresense
spresense.menu.Debug.Enabled.build.kernel={build.root}/{build.type}
spresense.menu.Debug.Enabled.build.libpath={build.kernel}/prebuilt

spresense.menu.UploadSpeed.115200=115200
spresense.menu.UploadSpeed.115200.upload.speed=
spresense.menu.UploadSpeed.230400=230400
spresense.menu.UploadSpeed.230400.upload.speed=-b 230400
spresense.menu.UploadSpeed.460800=460800
spresense.menu.UploadSpeed.460800.upload.speed=-b 460800
spresense.menu.UploadSpeed.500000=500000
spresense.menu.UploadSpeed.500000.upload.speed=-b 500000
spresense.menu.UploadSpeed.576000=576000
spresense.menu.UploadSpeed.576000.upload.speed=-b 576000
spresense.menu.UploadSpeed.921600=921600
spresense.menu.UploadSpeed.921600.upload.speed=-b 921600
spresense.menu.UploadSpeed.1000000=1000000
spresense.menu.UploadSpeed.1000000.upload.speed=-b 1000000
spresense.menu.UploadSpeed.1152000=1152000
spresense.menu.UploadSpeed.1152000.upload.speed=-b 1152000

